Revit 2024 API
DuctFittingAndAccessoryPressureDropUIDataItem Members
The DuctFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DuctFittingAndAccessoryPressureDropUIDataItem
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDuctFittingAndAccessoryData
 Gets the fitting data stored in the UI data item.
GetEntity
 Returns the entity set by UI server. or an invalid entity otherwise.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetEntity
 Stores the entity in the UI data item.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuctFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Mechanical Namespace